app/Models/TransaccionModel.php

SELECT `tblcuenta`.`idcuenta`, `tblcliente`.`nombre`, `tblcliente`.`apellido`, `tbltipot`.`descrtipo`, `tbltransaccion`.`monto`
FROM `tbltransaccion`
JOIN `tblcuenta` ON `tbltransaccion`.`idcuenta` = `tblcuenta`.`idcuenta`
JOIN `tbltipot` ON `tbltransaccion`.`idtipot` = `tbltipot`.`idtipot`
JOIN `tblcliente` ON `tblcuenta`.`idcliente` = `tblcliente`.`idcliente`
WHERE `tblcliente`.`idcliente` = '2'
---
    public function TransaccionesCliente($idcliente = null){
        $builder = $this->db->table($this->table);
        $builder->select('tblcuenta.idcuenta, tblcliente.nombre, tblcliente.apellido');
        $builder->select('tbltipot.descrtipo, tbltransaccion.monto');
        $builder->join('tblcuenta', 'tbltransaccion.idcuenta = tblcuenta.idcuenta');
        $builder->join('tbltipot', 'tbltransaccion.idtipot = tbltipot.idtipot');
        $builder->join('tblcliente', 'tblcuenta.idcliente = tblcliente.idcliente');
        $builder->where('tblcliente.idcliente', $idcliente);
        $query = $builder->get();